Tekla.Structures.Model.ChangeData.ChangeSourceTypeEnum
The source types of changed event.

Tekla.Structures.Model.ChangeData.ChangeSourceTypeEnum.COMMIT
Normal commit

Tekla.Structures.Model.ChangeData.ChangeSourceTypeEnum.UNDO_REDO
Undo or redo pressed

Tekla.Structures.Model.ChangeData.ChangeSourceTypeEnum.ROLLBACK
Rollback of database